Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: Discuss the development of Quarkus with the team in the <a href="mailto:quarkus-dev+subscribe@googlegroups.com">development mailing list </a> or by <a href="https://quarkusio.zulipchat.com/">Zulip Chat</a>.
es_es: Discute el desarrollo de Quarkus con el equipo en la <a href="mailto:quarkus-dev+subscribe@googlegroups.com">lista de correo de desarrollo</a> o por <a href="https://quarkusio.zulipchat.com/">Zulip Chat</a>.

source: Discussion about Quarkus
es_es: Discusión sobre Quarkus

source: Discussions and Collaboration
es_es: Debates y colaboración

source: Docker Options
es_es: Opciones de Docker

source: Documentation
es_es: Documentación

source: Don't see and extension you need? <a href="{{site.baseurl}}/createextensions">Request a new extension</a>
es_es: ¿No ve la extensión que necesita? <a href="{{site.baseurl}}/createextensions">Solicite una nueva extensión</a>

source: Download an {quickstarts-archive-url}[archive] or clone the git repository:
es_es: Descarga un {quickstarts-archive-url}[archive] o clona el repositorio git:

source: Downloads
es_es: Descargas

source: Due to the sensitive nature of security bugs, the disclosure process is more constrained than a regular bug. We appreciate you following these industry accepted guidelines, which gives time for a proper fix and limit the time window of attack.
es_es: Debido a la naturaleza delicada de los errores de seguridad, el proceso de divulgación es más restringido que un error normal. Agradecemos que siga estas pautas aceptadas por la industria, lo que le da tiempo para una corrección adecuada y limita la ventana de tiempo del ataque.

source: During the project creation, the `src/main/java/org/acme/GreetingResource.java` file has been created with the following content:
es_es: Durante la creación del proyecto, se ha creado el archivo `src/main/java/org/acme/GreetingResource.java` con el siguiente contenido:

source: Dynamic address names
es_es: Nombres de direcciones dinámicas

source: EXAMPLE APPLICATIONS
es_es: EJEMPLOS DE APLICACIONES

source: Each provided capability will be represented with an instance of `io.quarkus.deployment.builditem.CapabilityBuildItem` at build time. Theoretically, `CapabilityBuildItem`'s could be produced by extension build steps directly, bypassing the corresponding declaration in the extension descriptors. However, this way of providing capabilities should be avoided, unless there is a very good reason not to declare a capability in the descriptor.
es_es: Cada capacidad proporcionada se representará con una instancia de `io.quarkus.deployment.builditem.CapabilityBuildItem` en el momento de la construcción. Teóricamente, los `CapabilityBuildItem's podrían ser producidos por los pasos de construcción de la extensión directamente, pasando por alto la declaración correspondiente en los descriptores de la extensión. Sin embargo, esta forma de proporcionar capacidades debería evitarse, a menos que haya una muy buena razón para no declarar una capacidad en el descriptor.

source: Earlier this year we discovered a memory leak in the RESTEasy Reactive component in Quarkus. Within a few days, working with the Quarkus community, we were able to identify and fix the issue. This gave us the confidence that longer term, we’ll be able to resolve issues quickly.
es_es: A principios de este año descubrimos una fuga de memoria en el componente RESTEasy Reactive de Quarkus. En pocos días, trabajando con la comunidad de Quarkus, fuimos capaces de identificar y solucionar el problema. Esto nos dio la confianza de que, a largo plazo, seremos capaces de resolver los problemas rápidamente.

source: Eclipse Adoptium Uses Quarkus for high volume Java SE distribution API
es_es: Eclipse Adoptium utiliza Quarkus para una API de distribución de Java SE de gran volumen

source: Edit the `GreetingResource` class to inject the `GreetingService` and create a new endpoint using it:
es_es: Edite la clase `GreetingResource` para inyectar el `GreetingService` y cree un nuevo punto final utilizándolo:

source: Embedded Realm Configuration
es_es: Configuración del reino integrado

source: Embedded Roles
es_es: Funciones integradas

source: Embedded Users
es_es: Usuarios integrados

source: Enable Basic authentication
es_es: Activar la autenticación básica

source: Enable reading of secrets. Note the use of `%prod` profile as we only want this setting applied when the application is running in production.
es_es: Habilitar la lectura de secretos. Tenga en cuenta el uso del perfil `%prod` ya que sólo queremos que esta configuración se aplique cuando la aplicación se ejecute en producción.

source: Enable xref:security-basic-authentication.adoc[Basic authentication] for your Quarkus project and allow users to authenticate with a username and password.
es_es: Habilite la autenticación básica para su proyecto Quarkus y permita que los usuarios se autentiquen con un nombre de usuario y una contraseña.

source: Enables (default) or disables the Cloud Event support. If enabled on an _incoming_ channel, the connector analyzes the incoming records and try to create Cloud Event metadata. If enabled on an _outgoing_, the connector sends the outgoing messages as Cloud Event if the message includes Cloud Event Metadata. Type: _boolean_
es_es: Activa (por defecto) o desactiva el soporte de Cloud Event. Si se habilita en un canal de _entrada_, el conector analiza los registros entrantes e intenta crear metadatos de Cloud Event. Si se habilita en un canal _saliente_, el conector envía los mensajes salientes como Cloud Event si el mensaje incluye metadatos Cloud Event. Type: _boolean_

source: Enabling / Disabling Dev Services for AMQP
es_es: Activación/desactivación de los servicios de desarrollo para AMQP

source: Enabling / Disabling Dev Services for Apicurio Registry
es_es: Activación/desactivación de los servicios de desarrollo para el registro de Apicurio

source: Enabling / Disabling Dev Services for Elasticsearch
es_es: Activación/desactivación de los servicios de desarrollo para Elasticsearch

source: Enabling / Disabling Dev Services for Kafka
es_es: Activación/desactivación de los servicios de desarrollo para Kafka

source: Enabling / Disabling Dev Services for Kogito
es_es: Activación/desactivación de los servicios de desarrollo para Kogito

source: Enabling / Disabling Dev Services for Kubernetes
es_es: Activación y desactivación de los servicios de desarrollo para Kubernetes

source: Enabling / Disabling Dev Services for RabbitMQ
es_es: Activación/desactivación de los servicios de desarrollo para RabbitMQ

source: Enter Quarkus
es_es: Entra Quarkus

source: Enterprise support provided by Red Hat for the product.
es_es: Soporte empresarial proporcionado por Red Hat para el producto.

source: Error pages
es_es: Páginas de error

source: Every contribution is valuable. It can be a bug report, an example application, a feature request, a fix in the documentation or just feedback.
es_es: Todas las contribuciones son valiosas. Puede ser un informe de errores, una aplicación de ejemplo, una solicitud de función, una corrección en la documentación o simplemente un comentario.

source: Every developer has their favorite IDE. Learn how to use Quarkus in yours.
es_es: Cada desarrollador tiene su IDE favorito. Aprende a usar Quarkus en el tuyo.

source: Example configuration
es_es: Ejemplo de configuración

source: Examples
es_es: Ejemplos

source: Execution model and Blocking processing
es_es: Modelo de ejecución y procesamiento por bloqueo

source: Explore the wide breadth of technologies Quarkus with which applications can be made.
es_es: Explore la amplia gama de tecnologías Quarkus con las que se pueden realizar aplicaciones.

source: Expressions
es_es: Expresiones

source: Extending the image
es_es: Ampliación de la imagen

source: Extension Capabilities
es_es: Capacidades de ampliación

source: Extension Documentation
es_es: Documentación de la extensión

source: Extension Repository
es_es: Repositorio de extensiones

source: Extension Title Quarkiverse-JBeret
es_es: Título de la extensión Quarkiverse-JBeret

source: Extension Version
es_es: Versión ampliada

source: Extension Version: 1.1.1
es_es: Versión de la extensión: 1.1.1

source: Extensions have a various degree of maturity when they enter the Quarkus ecosystem. A status offers the expectations you can rely on.
es_es: Las extensiones tienen varios grados de madurez a medida que ingresan al ecosistema de Quarkus. El estado ofrece el valor esperado de confianza.

source: External application.yaml file
es_es: Archivo application.yaml externo

source: Extra parameters
es_es: Parámetros adicionales

source: Failure Management
es_es: Gestión de fallos

source: Feedback and Help
es_es: Comentarios y ayuda

source: Filter the Extensions
es_es: Filtrar las extensiones

source: Final touch, the HTML page reading the converted prices using SSE.
es_es: El toque final, la página HTML que lee los precios convertidos usando SSE.

source: Finally, authenticate your local Docker installation with this container registry by running:
es_es: Por último, autentique su instalación local de Docker con este registro de contenedores ejecutando:

source: Finally, we need to generate the Kubernetes manifests by running the command in a terminal:
es_es: Por último, tenemos que generar los manifiestos de Kubernetes ejecutando el comando en un terminal:

source: Finally, when both ConfigMaps and Secrets are used, the latter always a higher priority than the former.
es_es: Por último, cuando se utilizan tanto ConfigMaps como Secretos, estos últimos siempre tienen mayor prioridad que los primeros.

source: First build the Java artifacts:
es_es: Primero construya los artefactos Java:

source: First declare your service as follows:
es_es: Primero declare su servicio como sigue:

source: First step is to find the username and password for the admin, so that ACI can authenticate into ACR and pull the Docker image:
es_es: El primer paso es encontrar el nombre de usuario y la contraseña del administrador, para que ACI pueda autenticarse en ACR y extraer la imagen Docker:

source: First, create an Azure Resource Group:
es_es: En primer lugar, cree un grupo de recursos de Azure:

source: First, login to Heroku's container registry:
es_es: En primer lugar, inicie sesión en el registro de contenedores de Heroku:

source: First, make sure you stopped the applications, and build both applications in JVM mode with:
es_es: En primer lugar, asegúrese de que ha detenido las aplicaciones, y construya ambas aplicaciones en modo JVM con:

source: First, we need a new project. Create a new project with the following command:
es_es: En primer lugar, necesitamos un nuevo proyecto. Cree un nuevo proyecto con el siguiente comando:

source: First, we need to create two projects: the _producer_ and the _processor_.
es_es: En primer lugar, tenemos que crear dos proyectos: el _productor_ y el _procesador_.

source: First, you can consume messages from various brokers such as AMQP or Apache Kafka, and process these messages smoothly:
es_es: En primer lugar, puede consumir mensajes de varios brokers como AMQP o Apache Kafka, y procesar estos mensajes sin problemas:

source: First-Class Support for GraalVM Native Images
es_es: Soporte de primera clase para imágenes nativas de GraalVM

source: First: an example
es_es: Primero: un ejemplo

source: Follow Quarkus on Twitter
es_es: Siga a Quarkus en Twitter

source: For Confluent Schema Registry serde, that is:
es_es: Para Confluent Schema Registry serde, esto es:

source: For Funqy: {httpsTrigger.url}/funqy
es_es: Para Funqy: {httpsTrigger.url}/funqy

source: For Linux, macOS, and Windows (using WSL or bash compatible shell like Cygwin or MinGW)
es_es: Para Linux, macOS y Windows (utilizando WSL o un shell compatible con bash como Cygwin o MinGW)

source: For Reactive Routes: {httpsTrigger.url}/vertx/hello
es_es: Para las rutas reactivas: {httpsTrigger.url}/vertx/hello

source: For Strimzi, you can select any image with a Kafka version which has Kraft support (2.8.1 and higher) from https://quay.io/repository/strimzi-test-container/test-container?tab=tags
es_es: Para Strimzi, puede seleccionar cualquier imagen con una versión de Kafka que tenga soporte para Kraft (2.8.1 y superior) desde https://quay.io/repository/strimzi-test-container/test-container?tab=tags

source: For Windows using Powershell
es_es: Para Windows utilizando Powershell

source: For a Basic Authentication configuration walk-through that uses `JPA`, see the xref:security-getting-started.adoc[Getting Started With Security] guide.
es_es: Para ver un ejemplo de configuración de la Autenticación Básica que utiliza `JPA`, consulte la guía de xref:security-getting-started.adoc[Introducción a la Seguridad].

source: For a Basic authentication configuration walk-through that uses `JPA`, see the xref:security-getting-started.adoc[Getting Started With Security] guide.
es_es: Para ver una configuración de autenticación básica que utiliza `JPA`, consulte la guía de xref:security-getting-started.adoc[introducción a la seguridad].

source: For a more detailed walk-through that shows you how to configure Basic authentication together with Jakarta Persistence for storing user credentials in a database, see the xref:security-basic-authentication-tutorial.adoc[Secure a Quarkus application with Basic authentication and Jakarta Persistence] guide.
es_es: Para obtener un tutorial más detallado que muestra cómo configurar la autenticación básica junto con Jakarta Persistence para almacenar las credenciales de usuario en una base de datos, consulte xref:security-basic-authentication-tutorial.adoc[Asegure una aplicación Quarkus con autenticación básica y Jakarta Guía de persistencia.

source: For a regular JVM distribution you need to base your image off the official AWS Java base images. Below is an example of a Dockerfile that would create a container image from your Quarkus Lambda project. It assumes that `mvn package` has been executed and binaries are available in the `target/` directory:
es_es: Para una distribución regular de JVM necesitas basar tu imagen en las imágenes base oficiales de AWS Java. A continuación se muestra un ejemplo de un archivo Docker que crearía una imagen de contenedor de su proyecto Quarkus Lambda. Asume que `mvn package` ha sido ejecutado y los binarios están disponibles en el directorio `target/`:

source: For each call you are intending to do, add a method and use annotations to describe the behavior. You can combine the REST Client with the <a href="https://quarkus.io/guides/smallrye-fault-tolerance">fault tolerance extension</a> to handle failure gracefully. Then, in your resource, just use the <code>ElementService</code> interface:
es_es: Para cada llamada que pretendas hacer, añade un método y utiliza anotaciones para describir el comportamiento. Puedes combinar el cliente REST con la extensión <a href="https://quarkus.io/guides/smallrye-fault-tolerance">tolerancia a fallos</a> para manejar los fallos con elegancia. Luego, en tu recurso, sólo tienes que utilizar la interfaz <code>ElementService</code>:

source: For example by default reflection in GraalVM will not work, unless a class/member has been explicitly registered for reflection. This is normally achieved by listing every class, method, field and constructor in a JSON file, and passing this as a parameter into the native image build. This obviously gets quite cumbersome for all but the most trivial projects. Quarkus provides a framework that makes it easy to work around these annotations, and programmatically determine what should be registered.
es_es: Por ejemplo, de forma predeterminada, la reflexión en GraalVM no funcionará, a menos que una clase/miembro se haya registrado explícitamente para la reflexión. Esto normalmente se logra listando cada clase, método, campo y constructor en un archivo JSON, y pasándolo como un parámetro Obviamente, esto se vuelve bastante engorroso para todos los proyectos, excepto para los más triviales. Quarkus proporciona un marco que facilita el trabajo en torno a estas anotaciones y proporciona un marco que le permite decidir mediante programación qué registrar.

source: For example, The following code illustrates how you can store incoming payloads to a database using Hibernate with Panache:
es_es: Por ejemplo, el siguiente código ilustra cómo puede almacenar las cargas útiles entrantes en una base de datos utilizando Hibernate con Panache:

source: For example, you can send to a dynamic address based on the incoming message:
es_es: Por ejemplo, puede enviar a una dirección dinámica en función del mensaje entrante:

source: For information about other methods that you can use to configure the required user credentials, see the xref:security-testing.adoc#configuring-user-information[Configuring User Information] section of the Quarkus "Security Testing" guide.
es_es: Para obtener información sobre otros métodos que puede utilizar para configurar las credenciales de usuario requeridas, consulte la sección xref:security-testing.adoc#configuring-user-information[Configuración de información de usuario] de la guía "Pruebas de seguridad" de Quarkus.

source: For more information about Basic authentication, its mechanisms, and related identity providers, see the following resources:
es_es: Para obtener más información sobre la autenticación básica, sus mecanismos y los proveedores de identidad relacionados, consulte los siguientes recursos:

source: For more information and details on ACR authentication and the use of service principals, follow this guide below and remember the Azure Container Registry `loginServer` and the image name of your Quarkus application now hosted on the ACR.
es_es: Para obtener más información y detalles sobre la autenticación en el ACR y el uso de los principales del servicio, siga esta guía y recuerde el Azure Container Registry `loginServer` y el nombre de la imagen de su aplicación Quarkus ahora alojada en el ACR.

source: For more information on receiving Cloud Events, see https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_receiving_cloud_events[Receiving Cloud Events] in SmallRye Reactive Messaging documentation.
es_es: Para obtener más información sobre la recepción de eventos de la nube, consulte https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_receiving_cloud_events[Recepción de eventos de la nube] en la documentación de SmallRye Reactive Messaging.

source: For more information on sending Cloud Events, see https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_sending_cloud_events[Sending Cloud Events] in SmallRye Reactive Messaging documentation.
es_es: Para obtener más información sobre el envío de eventos de nube, consulte https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.12/amqp/amqp.html#_sending_cloud_events[Envío de eventos de nube] en la documentación de SmallRye Reactive Messaging.

source: For more options, such as Homebrew or Chocolatey, see <a href="/guides/cli-tooling">the Quarkus CLI guide</a>.
es_es: Para más opciones, como Homebrew o Chocolatey, véase <a href="/guides/cli-tooling">la guía de la CLI de Quarkus</a>.

source: For questions related to the development of Quarkus:
es_es: Para cuestiones relacionadas con el desarrollo de Quarkus:

source: For servlet: {httpsTrigger.url}/servlet/hello
es_es: Para el servlet: {httpsTrigger.url}/servlet/hello

source: For the last 25 years, Java has performed for organizations across the world but you've never seen anything like this. We'll cover all the classics like "Start Me Up" and "Living' on a VM" and some new jams like "Stairway to Native" and "Sweet JPA of Mine" and more.
es_es: Durante los últimos 25 años, Java ha actuado para organizaciones de todo el mundo, pero nunca habrás visto nada igual. Tocaremos todos los clásicos, como "Start Me Up" y "Living' on a VM", y algunas canciones nuevas, como "Stairway to Native" y "Sweet JPA of Mine", entre otras.

source: For this type of application, Quarkus relies on well-known standards such as JAX-RS, JPA and MicroProfile Rest Client, but also Hibernate with Panache to simplify interactions with databases.
es_es: Para este tipo de aplicaciones, Quarkus se apoya en estándares conocidos como JAX-RS, JPA y MicroProfile Rest Client, pero también en Hibernate con Panache para simplificar las interacciones con las bases de datos.

source: For usage questions, we recommend to:
es_es: Para preguntas sobre el uso, recomendamos:

source: For years, the client-server architecture has been the de-facto standard to build applications. But a significant shift happened. The <em>one model rules them all</em> age is over. A new range of applications and architectural styles have emerged and transformed how code is written and how applications are deployed and executed. HTTP microservices, reactive applications, event-driven architecture, and serverless are now central players in modern systems.
es_es: Durante años, la arquitectura cliente-servidor ha sido el estándar de facto para construir aplicaciones. Pero se ha producido un cambio significativo. La era de <em>un modelo los gobierna a todos</em> ha terminado. Ha surgido una nueva gama de aplicaciones y estilos arquitectónicos que han transformado la forma de escribir el código y de desplegar y ejecutar las aplicaciones. Los microservicios HTTP, las aplicaciones reactivas, la arquitectura basada en eventos y la ausencia de servidor son ahora protagonistas de los sistemas modernos.

source: Found a security vulnerability in Quarkus, its extensions or the dependencies they use? See the <a href="{{site.baseurl}}/security">security policy page</a> to learn to report it.
es_es: ¿Has encontrado una vulnerabilidad de seguridad en Quarkus, sus extensiones o las dependencias que utilizan? Consulte la página <a href="{{site.baseurl}}/security">política de seguridad</a> para aprender a informarla.

source: From the outset, Quarkus has been designed around a container-first philosophy. What this means in concrete terms is that Quarkus applications are optimised for low memory usage and fast startup times in the following ways:
es_es: Desde el principio, Quarkus ha sido diseñado en torno a una filosofía de "contenedor primero". Lo que esto significa en términos concretos es que las aplicaciones de Quarkus están optimizadas para un bajo uso de memoria y tiempos de arranque rápidos de las siguientes maneras:

source: Full changelog
es_es: Registro completo de cambios

source: Function Names
es_es: Nombres de las funciones

source: Functional tests
es_es: Pruebas funcionales

source: Funqy Basics
es_es: Fundamentos de Funqy

source: Funqy HTTP Binding with Amazon Lambda
es_es: Enlace HTTP de Funqy con Amazon Lambda

source: Funqy HTTP Binding with Azure Functions
es_es: Enlace HTTP de Funqy con Azure Functions

source: Funqy HTTP Binding with Google Cloud Functions
es_es: Enlace HTTP de Funqy con Google Cloud Functions

source: Funqy Knative Events Binding
es_es: Vinculación de los eventos de Funqy Knative

source: Funqy also works with Quarkus Dev mode!
es_es: ¡Funqy también funciona con el modo Quarkus Dev!

source: Funqy and Cloud Events
es_es: Eventos de Funqy y Cloud

source: Furthermore, when multiple ConfigMaps (or Secrets) are used, ConfigMaps (or Secrets) defined later in the list have a higher priority that ConfigMaps defined earlier in the list.
es_es: Además, cuando se utilizan varios ConfigMaps (o Secretos), los ConfigMaps (o Secretos) definidos más tarde en la lista tienen una mayor prioridad que los ConfigMaps definidos anteriormente en la lista.

source: Get Started
es_es: Primeros pasos
